# StructuralMaterialType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..StructuralMaterialType Property
Family Class See Also
---
The family's structural material type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public StructuralMaterialType StructuralMaterialType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
```

Visual C++
---
```text
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
```

# See Also
Family Class
Autodesk.Revit.DB Namespace